// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "家里的顶梁柱",  // 同上...
        "小步步和她妹妹的妈妈",  // 同上...
        "刘老师的美腻老婆",  // 同上...
        "亲爱的瑛老师",
        "今天是你的生日",
        "祝你生日快乐",
        "往后余生",
        "带着我们仨吃香的喝辣的",
        "走遍世界各地的大街小巷",
        "领略完美人生的酸甜苦辣",
        "我们爱你",
        "YAMI~~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "家里的顶梁柱": "./imgs/dingliangzhu.jpg",
        "小步步和她妹妹的妈妈": "./imgs/mama.jpg",
        "刘老师的美腻老婆": "./imgs/laopo.jpg",
         "亲爱的瑛老师": "./imgs/ying.jpg",
         "带着我们仨吃香的喝辣的": "./imgs/chi.jpg",
         "走遍世界各地的大街小巷": "./imgs/lvyou.jpg",
         "领略完美人生的酸甜苦辣": "./imgs/kaixin.jpg",
         "我们爱你": "./imgs/aini.jpg",

    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
